/*******************************************************************************
 * Copyright IBM Corp. and others 2023
 *
 * This program and the accompanying materials are made available under
 * the terms of the Eclipse Public License 2.0 which accompanies this
 * distribution and is available at https://www.eclipse.org/legal/epl-2.0/
 * or the Apache License, Version 2.0 which accompanies this distribution and
 * is available at https://www.apache.org/licenses/LICENSE-2.0.
 *
 * This Source Code may also be made available under the following
 * Secondary Licenses when the conditions for such availability set
 * forth in the Eclipse Public License, v. 2.0 are satisfied: GNU
 * General Public License, version 2 with the GNU Classpath
 * Exception [1] and GNU General Public License, version 2 with the
 * OpenJDK Assembly Exception [2].
 *
 * [1] https://www.gnu.org/software/classpath/license.html
 * [2] https://openjdk.org/legal/assembly-exception.html
 *
 * SPDX-License-Identifier: EPL-2.0 OR Apache-2.0 OR GPL-2.0 WITH Classpath-exception-2.0 OR LicenseRef-GPL-2.0 WITH Assembly-exception
 *******************************************************************************/
package org.openj9.test.jep434.valist;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodHandles;
import java.lang.invoke.MethodHandles.Lookup;
import java.lang.invoke.MethodType;
import static java.lang.invoke.MethodType.methodType;
import java.lang.invoke.VarHandle;


	public static float add2FloatsOfStructsFromVaList(int argCount, MemorySegment struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(JAVA_FLOAT.withName("elem1"), JAVA_FLOAT.withName("elem2"));
		VarHandle elemHandle1 = structLayout.varHandle(PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(PathElement.groupElement("elem2"));

		float floatSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr.address(), scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.nextVarg(structLayout, allocator);
			floatSum += (float)elemHandle1.get(argSegmt) + (float)elemHandle2.get(argSegmt);
			argCount--;
		}
		return floatSum;
	}

	public static float add3FloatsOfStructsFromVaList(int argCount, MemorySegment struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(JAVA_FLOAT.withName("elem1"),
				JAVA_FLOAT.withName("elem2"), JAVA_FLOAT.withName("elem3"));
		VarHandle elemHandle1 = structLayout.varHandle(PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(PathElement.groupElement("elem2"));
		VarHandle elemHandle3 = structLayout.varHandle(PathElement.groupElement("elem3"));

		float floatSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr.address(), scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.nextVarg(structLayout, allocator);
			floatSum += (float)elemHandle1.get(argSegmt) + (float)elemHandle2.get(argSegmt) + (float)elemHandle3.get(argSegmt);
			argCount--;
		}
		return floatSum;
	}

	public static double add1DoubleOfStructsFromVaList(int argCount, MemorySegment struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(JAVA_DOUBLE.withName("elem1"));
		VarHandle elemHandle1 = structLayout.varHandle(PathElement.groupElement("elem1"));

		double doubleSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr.address(), scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.nextVarg(structLayout, allocator);
			doubleSum += (double)elemHandle1.get(argSegmt);
			argCount--;
		}
		return doubleSum;
	}

	public static double add2DoublesOfStructsFromVaList(int argCount, MemorySegment struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(JAVA_DOUBLE.withName("elem1"), JAVA_DOUBLE.withName("elem2"));
		VarHandle elemHandle1 = structLayout.varHandle(PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(PathElement.groupElement("elem2"));

		double doubleSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr.address(), scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.nextVarg(structLayout, allocator);
			doubleSum += (double)elemHandle1.get(argSegmt) + (double)elemHandle2.get(argSegmt);
			argCount--;
		}
		return doubleSum;
	}

	public static int addIntShortOfStructsFromVaList(int argCount, MemorySegment struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(JAVA_INT.withName("elem1"),
				JAVA_SHORT.withName("elem2"), MemoryLayout.paddingLayout(16));
		VarHandle elemHandle1 = structLayout.varHandle(PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(PathElement.groupElement("elem2"));

		int intSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr.address(), scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.nextVarg(structLayout, allocator);
			intSum += (int)elemHandle1.get(argSegmt) + (short)elemHandle2.get(argSegmt);
			argCount--;
		}
		return intSum;
	}

	public static int addShortIntOfStructsFromVaList(int argCount, MemorySegment struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(JAVA_SHORT.withName("elem1"),
		MemoryLayout.paddingLayout(16), JAVA_INT.withName("elem2"));
		VarHandle elemHandle1 = structLayout.varHandle(PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(PathElement.groupElement("elem2"));

		int intSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr.address(), scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.nextVarg(structLayout, allocator);
			intSum += (short)elemHandle1.get(argSegmt) + (int)elemHandle2.get(argSegmt);
			argCount--;
		}
		return intSum;
	}

	public static long addLongIntOfStructsFromVaList(int argCount, MemorySegment struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(JAVA_LONG.withName("elem1"),
				JAVA_INT.withName("elem2"), MemoryLayout.paddingLayout(32));
		VarHandle elemHandle1 = structLayout.varHandle(PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(PathElement.groupElement("elem2"));

		long longSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr.address(), scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.nextVarg(structLayout, allocator);
			longSum += (long)elemHandle1.get(argSegmt) + (int)elemHandle2.get(argSegmt);
			argCount--;
		}
		return longSum;
	}

	public static long addIntLongOfStructsFromVaList(int argCount, MemorySegment struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(JAVA_INT.withName("elem1"),
		MemoryLayout.paddingLayout(32), JAVA_LONG.withName("elem2"));
		VarHandle elemHandle1 = structLayout.varHandle(PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(PathElement.groupElement("elem2"));

		long longSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr.address(), scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.nextVarg(structLayout, allocator);
			longSum += (int)elemHandle1.get(argSegmt) + (long)elemHandle2.get(argSegmt);
			argCount--;
		}
		return longSum;
	}

	public static double addFloatDoubleOfStructsFromVaList(int argCount, MemorySegment struVaListAddr) {
		/* The size of [float, double] on AIX/PPC 64-bit is 12 bytes without padding by default
		 * while the same struct is 16 bytes with padding on other platforms.
		 */
		GroupLayout structLayout = isAixOS ? MemoryLayout.structLayout(JAVA_FLOAT.withName("elem1"),
				JAVA_DOUBLE.withName("elem2").withBitAlignment(32)) : MemoryLayout.structLayout(JAVA_FLOAT.withName("elem1"),
				MemoryLayout.paddingLayout(32), JAVA_DOUBLE.withName("elem2"));
		VarHandle elemHandle1 = structLayout.varHandle(PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(PathElement.groupElement("elem2"));

		double doubleSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr.address(), scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.nextVarg(structLayout, allocator);
			doubleSum += (float)elemHandle1.get(argSegmt) + (double)elemHandle2.get(argSegmt);
			argCount--;
		}
		return doubleSum;
	}

	public static double addDoubleFloatOfStructsFromVaList(int argCount, MemorySegment struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(JAVA_DOUBLE.withName("elem1"),
				JAVA_FLOAT.withName("elem2") , MemoryLayout.paddingLayout(32));
		VarHandle elemHandle1 = structLayout.varHandle(PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(PathElement.groupElement("elem2"));

		double doubleSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr.address(), scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.nextVarg(structLayout, allocator);
			doubleSum += (double)elemHandle1.get(argSegmt) + (float)elemHandle2.get(argSegmt);
			argCount--;
		}
		return doubleSum;
	}
}
