/*
 * Copyright IBM Corp. and others 2021
 *
 * This program and the accompanying materials are made available under
 * the terms of the Eclipse Public License 2.0 which accompanies this
 * distribution and is available at https://www.eclipse.org/legal/epl-2.0/
 * or the Apache License, Version 2.0 which accompanies this distribution and
 * is available at https://www.apache.org/licenses/LICENSE-2.0.
 *
 * This Source Code may also be made available under the following
 * Secondary Licenses when the conditions for such availability set
 * forth in the Eclipse Public License, v. 2.0 are satisfied: GNU
 * General Public License, version 2 with the GNU Classpath
 * Exception [1] and GNU General Public License, version 2 with the
 * OpenJDK Assembly Exception [2].
 *
 * [1] https://www.gnu.org/software/classpath/license.html
 * [2] https://openjdk.org/legal/assembly-exception.html
 *
 * SPDX-License-Identifier: EPL-2.0 OR Apache-2.0 OR GPL-2.0-only WITH Classpath-exception-2.0 OR GPL-2.0-only WITH OpenJDK-assembly-exception-1.0
 */
package org.openj9.test.jep389.valist;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodHandles;
import java.lang.invoke.MethodHandles.Lookup;
import java.lang.invoke.MethodType;
import static java.lang.invoke.MethodType.methodType;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;

import static jdk.incubator.foreign.CLinker.C_CHAR;
import static jdk.incubator.foreign.CLinker.C_DOUBLE;

	public static float add3FloatsOfStructsFromVaList(int argCount, MemoryAddress struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(C_FLOAT.withName("elem1"),
				C_FLOAT.withName("elem2"), C_FLOAT.withName("elem3"));
		VarHandle elemHandle1 = structLayout.varHandle(float.class, PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(float.class, PathElement.groupElement("elem2"));
		VarHandle elemHandle3 = structLayout.varHandle(float.class, PathElement.groupElement("elem3"));

		float floatSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr, scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.vargAsSegment(structLayout, allocator);
			floatSum += (float)elemHandle1.get(argSegmt) + (float)elemHandle2.get(argSegmt) + (float)elemHandle3.get(argSegmt);
			argCount--;
		}
		return floatSum;
	}

	public static double add1DoubleOfStructsFromVaList(int argCount, MemoryAddress struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(C_DOUBLE.withName("elem1"));
		VarHandle elemHandle1 = structLayout.varHandle(double.class, PathElement.groupElement("elem1"));

		double doubleSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr, scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.vargAsSegment(structLayout, allocator);
			doubleSum += (double)elemHandle1.get(argSegmt);
			argCount--;
		}
		return doubleSum;
	}

	public static double add2DoublesOfStructsFromVaList(int argCount, MemoryAddress struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(C_DOUBLE.withName("elem1"), C_DOUBLE.withName("elem2"));
		VarHandle elemHandle1 = structLayout.varHandle(double.class, PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(double.class, PathElement.groupElement("elem2"));

		double doubleSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr, scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.vargAsSegment(structLayout, allocator);
			doubleSum += (double)elemHandle1.get(argSegmt) + (double)elemHandle2.get(argSegmt);
			argCount--;
		}
		return doubleSum;
	}

	public static int addIntShortOfStructsFromVaList(int argCount, MemoryAddress struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(C_INT.withName("elem1"), C_SHORT.withName("elem2"));
		VarHandle elemHandle1 = structLayout.varHandle(int.class, PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(short.class, PathElement.groupElement("elem2"));

		int intSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr, scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.vargAsSegment(structLayout, allocator);
			intSum += (int)elemHandle1.get(argSegmt) + (short)elemHandle2.get(argSegmt);
			argCount--;
		}
		return intSum;
	}

	public static int addShortIntOfStructsFromVaList(int argCount, MemoryAddress struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(C_SHORT.withName("elem1"),
		MemoryLayout.paddingLayout(16), C_INT.withName("elem2"));
		VarHandle elemHandle1 = structLayout.varHandle(short.class, PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(int.class, PathElement.groupElement("elem2"));

		int intSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr, scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.vargAsSegment(structLayout, allocator);
			intSum += (short)elemHandle1.get(argSegmt) + (int)elemHandle2.get(argSegmt);
			argCount--;
		}
		return intSum;
	}

	public static long addLongIntOfStructsFromVaList(int argCount, MemoryAddress struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(longLayout.withName("elem1"),
				C_INT.withName("elem2"), MemoryLayout.paddingLayout(32));
		VarHandle elemHandle1 = structLayout.varHandle(long.class, PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(int.class, PathElement.groupElement("elem2"));

		long longSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr, scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.vargAsSegment(structLayout, allocator);
			longSum += (long)elemHandle1.get(argSegmt) + (int)elemHandle2.get(argSegmt);
			argCount--;
		}
		return longSum;
	}

	public static long addIntLongOfStructsFromVaList(int argCount, MemoryAddress struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(C_INT.withName("elem1"),
		MemoryLayout.paddingLayout(32), longLayout.withName("elem2"));
		VarHandle elemHandle1 = structLayout.varHandle(int.class, PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(long.class, PathElement.groupElement("elem2"));

		long longSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr, scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.vargAsSegment(structLayout, allocator);
			longSum += (int)elemHandle1.get(argSegmt) + (long)elemHandle2.get(argSegmt);
			argCount--;
		}
		return longSum;
	}

	public static double addFloatDoubleOfStructsFromVaList(int argCount, MemoryAddress struVaListAddr) {
		/* The size of [float, double] on AIX/PPC 64-bit is 12 bytes without padding by default
		 * while the same struct is 16 bytes with padding on other platforms.
		 */
		GroupLayout structLayout = isAixOS ? MemoryLayout.structLayout(C_FLOAT.withName("elem1"),
				C_DOUBLE.withName("elem2")) : MemoryLayout.structLayout(C_FLOAT.withName("elem1"),
				MemoryLayout.paddingLayout(32), C_DOUBLE.withName("elem2"));
		VarHandle elemHandle1 = structLayout.varHandle(float.class, PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(double.class, PathElement.groupElement("elem2"));

		double doubleSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr, scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.vargAsSegment(structLayout, allocator);
			doubleSum += (float)elemHandle1.get(argSegmt) + (double)elemHandle2.get(argSegmt);
			argCount--;
		}
		return doubleSum;
	}

	public static double addDoubleFloatOfStructsFromVaList(int argCount, MemoryAddress struVaListAddr) {
		GroupLayout structLayout = MemoryLayout.structLayout(C_DOUBLE.withName("elem1"),
				C_FLOAT.withName("elem2"), MemoryLayout.paddingLayout(32));
		VarHandle elemHandle1 = structLayout.varHandle(double.class, PathElement.groupElement("elem1"));
		VarHandle elemHandle2 = structLayout.varHandle(float.class, PathElement.groupElement("elem2"));

		double doubleSum = 0;
		VaList struVaList = VaList.ofAddress(struVaListAddr, scope);
		while (argCount > 0) {
			MemorySegment argSegmt = struVaList.vargAsSegment(structLayout, allocator);
			doubleSum += (double)elemHandle1.get(argSegmt) + (float)elemHandle2.get(argSegmt);
			argCount--;
		}
		return doubleSum;
	}
}
